<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for NH Secure Browser.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.NHSecureBrowser-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NHSecureBrowser</string>
        <key>DOWNLOAD_URL</key>
        <string>"https://sb.portal.cambiumast.com/geturls?clientName=newHampshire&operatingSystem=windows"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%[0-9\.]+-64bit.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
