<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for NH Secure Browser.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.NHSecureBrowser-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NHSecureBrowser</string>
        <key>DOWNLOAD_URL</key>
        <string>https://sb.portal.cambiumast.com/geturls?clientName=newHampshire&amp;operatingSystem=windows</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloaderPython</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>prefetch_filename</key>
                <string>True</string>
            </dict>
        </dict>
        <!--dict>
            <key>Processor</key>
            <string>Regex</string>
            <key>Arguments</key>
            <dict>
                <key>searchString</key>
                <string>%pathname%</string>
                <key>regexString</key>
                <string>NHSecureBrowser([0-9\.]+)-64bit.msi</string>
            </dict>
        </dict-->
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CreatePath</string>
            <key>Arguments</key>
            <dict>
                <key>filepath</key>
                <string>e:\Apps\NHSecureBrowser\%regoutput%\</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Comment</key>
            <string>Move the file to the Apps dir.</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%pathname%</string>
                <key>target</key>
                <string>e:\Apps\NHSecureBrowser\%regoutput%\%NAME%-%regoutput%-64bit.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CreateWin32Intune</string>
            <key>Arguments</key>
            <dict>
                <key>exe</key>
                <string>e:\\Tools\Microsoft-Win32-Content-Prep-Tool-1.8.6\IntuneWinAppUtil.exe</string>
                <key>source</key>
                <string>e:\Apps\NHSecureBrowser\%regoutput%</string>
                <key>targetExe</key>
                <string>%NAME%-%regoutput%-64bit.msi</string>
                <key>destination</key>
                <string>e:\IntuneWIN\NHSecureBrowser\%regoutput%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
