<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for VEX Tournament Manager.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.vexTournamentManager-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>vexTournamentManager</string>
        <key>HOMEPAGE_URL</key>
        <string>https://vextm.dwabtech.com/</string>
        <key>PAGE_REGEX</key>
        <string>\/\/vextm.dwabtech.com\/releases\/(v[0-9\.]+_[0-9\.]+)\/VEXTournamentManager-v[0-9\.]+_[0-9\.]+.exe</string>
        <key>APP_VERSION</key>
        <string></string>
        <key>DOWNLOAD_URL</key>
        <string>https://vextm.dwabtech.com/releases/%APP_VERSION%/VEXTournamentManager-%APP_VERSION%.exe</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.7.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>%PAGE_REGEX%</string>
                <key>url</key>
                <string>%HOMEPAGE_URL%</string>
                <key>result_output_var_name</key>
                <string>APP_VERSION</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://vextm.dwabtech.com/releases/%APP_VERSION%/VEXTournamentManager-%APP_VERSION%.exe</string>
                <key>filename</key>
                <string>%NAME%-%APP_VERSION%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CreatePath</string>
            <key>filepath</key>
            <string>e:\Apps\vexTournamentManager\%APP_VERSION%\</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
			<key>Comment</key>
			<string>Move the file to the Apps dir.</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%pathname%</string>
                <key>target</key>
                <string>e:\Apps\vexTournamentManager\%APP_VERSION%\%NAME%-%APP_VERSION%.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
